app/controllers/api/v1/fruits_controller.rb

  def index
    render json: Fruit.all
---
SELECT "fruits".* FROM "fruits"

  def create
    fruit = Fruit.create(fruit_params)
---
INSERT INTO "fruits" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asdf"], ["description", "asdf"], ["created_at", "2018-05-31 12:46:30.688216"], ["updated_at", "2018-05-31 12:46:30.688216"]]

  def destroy
    Fruit.destroy(params[:id])
---
DELETE FROM "fruits" WHERE "fruits"."id" = ?  [["id", 1]]

  def update
    fruit = Fruit.find(params[:id])
    fruit.update_attributes(fruit_params)
---
SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
UPDATE "fruits" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "fruits"."id" = ?  [["name", "potatoe"], ["description", "1"], ["updated_at", "2018-05-31 22:06:53.955447"], ["id", 62]]