app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("encrypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?)